; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-1-1-1-6-2-6) (:domain depots)
(:objects
	depot0 - Depot
	distributor0 - Distributor
	truck0 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 - Crate
	hoist0 hoist1 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate1)
	(at pallet1 distributor0)
	(clear crate0)
	(at pallet2 distributor0)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate3)
	(at pallet4 distributor0)
	(clear crate5)
	(at pallet5 depot0)
	(clear crate4)
	(at truck0 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 distributor0)
	(on crate2 pallet4)
	(at crate3 distributor0)
	(on crate3 pallet3)
	(at crate4 depot0)
	(on crate4 pallet5)
	(at crate5 distributor0)
	(on crate5 crate2)
)

(:goal (and
		(on crate0 crate1)
		(on crate1 pallet3)
		(on crate2 pallet1)
		(on crate3 crate5)
		(on crate4 crate2)
		(on crate5 crate0)
	)
))

; plan
1. (lift hoist1 crate3 pallet3 distributor0)
   deleted: (at crate3 distributor0) (available hoist1) (on crate3 pallet3) (clear crate3)
   added: (lifting hoist1 crate3) (clear pallet3)
   goals met: 0 of 6
2. (drop hoist1 crate3 crate5 distributor0)
   deleted: (lifting hoist1 crate3) (clear crate5)
   added: (at crate3 distributor0) (available hoist1) (on crate3 crate5) (clear crate3)
   goals met: 1 of 6
3. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (available hoist0) (on crate1 pallet0) (clear crate1)
   added: (lifting hoist0 crate1) (clear pallet0)
   goals met: 1 of 6
4. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (available hoist1) (on crate0 pallet1) (clear crate0)
   added: (lifting hoist1 crate0) (clear pallet1)
   goals met: 1 of 6
5. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   goals met: 1 of 6
6. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 1 of 6
7. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   goals met: 1 of 6
8. (lift hoist0 crate4 pallet5 depot0)
   deleted: (at crate4 depot0) (available hoist0) (on crate4 pallet5) (clear crate4)
   added: (lifting hoist0 crate4) (clear pallet5)
   goals met: 1 of 6
9. (load hoist0 crate4 truck0 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck0) (available hoist0)
   goals met: 1 of 6
10. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 1 of 6
11. (unload hoist1 crate1 truck0 distributor0)
   deleted: (available hoist1) (in crate1 truck0)
   added: (lifting hoist1 crate1)
   goals met: 1 of 6
12. (drop hoist1 crate1 pallet3 distributor0)
   deleted: (lifting hoist1 crate1) (clear pallet3)
   added: (at crate1 distributor0) (available hoist1) (on crate1 pallet3) (clear crate1)
   goals met: 2 of 6
13. (unload hoist1 crate0 truck0 distributor0)
   deleted: (available hoist1) (in crate0 truck0)
   added: (lifting hoist1 crate0)
   goals met: 2 of 6
14. (drop hoist1 crate0 crate1 distributor0)
   deleted: (lifting hoist1 crate0) (clear crate1)
   added: (at crate0 distributor0) (available hoist1) (on crate0 crate1) (clear crate0)
   goals met: 3 of 6
15. (lift hoist1 crate3 crate5 distributor0)
   deleted: (at crate3 distributor0) (available hoist1) (on crate3 crate5) (clear crate3)
   added: (lifting hoist1 crate3) (clear crate5)
   goals met: 2 of 6
16. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   goals met: 2 of 6
17. (lift hoist1 crate5 crate2 distributor0)
   deleted: (at crate5 distributor0) (available hoist1) (on crate5 crate2) (clear crate5)
   added: (lifting hoist1 crate5) (clear crate2)
   goals met: 2 of 6
18. (drop hoist1 crate5 crate0 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate0)
   added: (at crate5 distributor0) (available hoist1) (on crate5 crate0) (clear crate5)
   goals met: 3 of 6
19. (lift hoist1 crate2 pallet4 distributor0)
   deleted: (at crate2 distributor0) (available hoist1) (on crate2 pallet4) (clear crate2)
   added: (lifting hoist1 crate2) (clear pallet4)
   goals met: 3 of 6
20. (drop hoist1 crate2 pallet1 distributor0)
   deleted: (lifting hoist1 crate2) (clear pallet1)
   added: (at crate2 distributor0) (available hoist1) (on crate2 pallet1) (clear crate2)
   goals met: 4 of 6
21. (unload hoist1 crate3 truck0 distributor0)
   deleted: (available hoist1) (in crate3 truck0)
   added: (lifting hoist1 crate3)
   goals met: 4 of 6
22. (drop hoist1 crate3 crate5 distributor0)
   deleted: (lifting hoist1 crate3) (clear crate5)
   added: (at crate3 distributor0) (available hoist1) (on crate3 crate5) (clear crate3)
   goals met: 5 of 6
23. (unload hoist1 crate4 truck0 distributor0)
   deleted: (available hoist1) (in crate4 truck0)
   added: (lifting hoist1 crate4)
   goals met: 5 of 6
24. (drop hoist1 crate4 crate2 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate2)
   added: (at crate4 distributor0) (available hoist1) (on crate4 crate2) (clear crate4)
   goals met: 6 of 6
